; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p14---int100n150-m25---int100c200---s442---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level8 level8)
(sum level0 level12 level12)
(sum level0 level19 level19)
(sum level0 level21 level21)
(sum level0 level24 level24)
(sum level1 level4 level5)
(sum level1 level8 level9)
(sum level1 level12 level13)
(sum level1 level19 level20)
(sum level1 level21 level22)
(sum level1 level24 level25)
(sum level2 level4 level6)
(sum level2 level8 level10)
(sum level2 level12 level14)
(sum level2 level19 level21)
(sum level2 level21 level23)
(sum level2 level24 level26)
(sum level3 level4 level7)
(sum level3 level8 level11)
(sum level3 level12 level15)
(sum level3 level19 level22)
(sum level3 level21 level24)
(sum level3 level24 level27)
(sum level4 level4 level8)
(sum level4 level8 level12)
(sum level4 level12 level16)
(sum level4 level19 level23)
(sum level4 level21 level25)
(sum level4 level24 level28)
(sum level5 level4 level9)
(sum level5 level8 level13)
(sum level5 level12 level17)
(sum level5 level19 level24)
(sum level5 level21 level26)
(sum level5 level24 level29)
(sum level6 level4 level10)
(sum level6 level8 level14)
(sum level6 level12 level18)
(sum level6 level19 level25)
(sum level6 level21 level27)
(sum level6 level24 level30)
(sum level7 level4 level11)
(sum level7 level8 level15)
(sum level7 level12 level19)
(sum level7 level19 level26)
(sum level7 level21 level28)
(sum level7 level24 level31)
(sum level8 level4 level12)
(sum level8 level8 level16)
(sum level8 level12 level20)
(sum level8 level19 level27)
(sum level8 level21 level29)
(sum level8 level24 level32)
(sum level9 level4 level13)
(sum level9 level8 level17)
(sum level9 level12 level21)
(sum level9 level19 level28)
(sum level9 level21 level30)
(sum level9 level24 level33)
(sum level10 level4 level14)
(sum level10 level8 level18)
(sum level10 level12 level22)
(sum level10 level19 level29)
(sum level10 level21 level31)
(sum level10 level24 level34)
(sum level11 level4 level15)
(sum level11 level8 level19)
(sum level11 level12 level23)
(sum level11 level19 level30)
(sum level11 level21 level32)
(sum level11 level24 level35)
(sum level12 level4 level16)
(sum level12 level8 level20)
(sum level12 level12 level24)
(sum level12 level19 level31)
(sum level12 level21 level33)
(sum level12 level24 level36)
(sum level13 level4 level17)
(sum level13 level8 level21)
(sum level13 level12 level25)
(sum level13 level19 level32)
(sum level13 level21 level34)
(sum level13 level24 level37)
(sum level14 level4 level18)
(sum level14 level8 level22)
(sum level14 level12 level26)
(sum level14 level19 level33)
(sum level14 level21 level35)
(sum level14 level24 level38)
(sum level15 level4 level19)
(sum level15 level8 level23)
(sum level15 level12 level27)
(sum level15 level19 level34)
(sum level15 level21 level36)
(sum level15 level24 level39)
(sum level16 level4 level20)
(sum level16 level8 level24)
(sum level16 level12 level28)
(sum level16 level19 level35)
(sum level16 level21 level37)
(sum level16 level24 level40)
(sum level17 level4 level21)
(sum level17 level8 level25)
(sum level17 level12 level29)
(sum level17 level19 level36)
(sum level17 level21 level38)
(sum level17 level24 level41)
(sum level18 level4 level22)
(sum level18 level8 level26)
(sum level18 level12 level30)
(sum level18 level19 level37)
(sum level18 level21 level39)
(sum level18 level24 level42)
(sum level19 level4 level23)
(sum level19 level8 level27)
(sum level19 level12 level31)
(sum level19 level19 level38)
(sum level19 level21 level40)
(sum level19 level24 level43)
(sum level20 level4 level24)
(sum level20 level8 level28)
(sum level20 level12 level32)
(sum level20 level19 level39)
(sum level20 level21 level41)
(sum level20 level24 level44)
(sum level21 level4 level25)
(sum level21 level8 level29)
(sum level21 level12 level33)
(sum level21 level19 level40)
(sum level21 level21 level42)
(sum level21 level24 level45)
(sum level22 level4 level26)
(sum level22 level8 level30)
(sum level22 level12 level34)
(sum level22 level19 level41)
(sum level22 level21 level43)
(sum level22 level24 level46)
(sum level23 level4 level27)
(sum level23 level8 level31)
(sum level23 level12 level35)
(sum level23 level19 level42)
(sum level23 level21 level44)
(sum level23 level24 level47)
(sum level24 level4 level28)
(sum level24 level8 level32)
(sum level24 level12 level36)
(sum level24 level19 level43)
(sum level24 level21 level45)
(sum level24 level24 level48)
(sum level25 level4 level29)
(sum level25 level8 level33)
(sum level25 level12 level37)
(sum level25 level19 level44)
(sum level25 level21 level46)
(sum level25 level24 level49)
(sum level26 level4 level30)
(sum level26 level8 level34)
(sum level26 level12 level38)
(sum level26 level19 level45)
(sum level26 level21 level47)
(sum level26 level24 level50)
(sum level27 level4 level31)
(sum level27 level8 level35)
(sum level27 level12 level39)
(sum level27 level19 level46)
(sum level27 level21 level48)
(sum level27 level24 level51)
(sum level28 level4 level32)
(sum level28 level8 level36)
(sum level28 level12 level40)
(sum level28 level19 level47)
(sum level28 level21 level49)
(sum level28 level24 level52)
(sum level29 level4 level33)
(sum level29 level8 level37)
(sum level29 level12 level41)
(sum level29 level19 level48)
(sum level29 level21 level50)
(sum level29 level24 level53)
(sum level30 level4 level34)
(sum level30 level8 level38)
(sum level30 level12 level42)
(sum level30 level19 level49)
(sum level30 level21 level51)
(sum level30 level24 level54)
(sum level31 level4 level35)
(sum level31 level8 level39)
(sum level31 level12 level43)
(sum level31 level19 level50)
(sum level31 level21 level52)
(sum level31 level24 level55)
(sum level32 level4 level36)
(sum level32 level8 level40)
(sum level32 level12 level44)
(sum level32 level19 level51)
(sum level32 level21 level53)
(sum level32 level24 level56)
(sum level33 level4 level37)
(sum level33 level8 level41)
(sum level33 level12 level45)
(sum level33 level19 level52)
(sum level33 level21 level54)
(sum level33 level24 level57)
(sum level34 level4 level38)
(sum level34 level8 level42)
(sum level34 level12 level46)
(sum level34 level19 level53)
(sum level34 level21 level55)
(sum level34 level24 level58)
(sum level35 level4 level39)
(sum level35 level8 level43)
(sum level35 level12 level47)
(sum level35 level19 level54)
(sum level35 level21 level56)
(sum level35 level24 level59)
(sum level36 level4 level40)
(sum level36 level8 level44)
(sum level36 level12 level48)
(sum level36 level19 level55)
(sum level36 level21 level57)
(sum level36 level24 level60)
(sum level37 level4 level41)
(sum level37 level8 level45)
(sum level37 level12 level49)
(sum level37 level19 level56)
(sum level37 level21 level58)
(sum level37 level24 level61)
(sum level38 level4 level42)
(sum level38 level8 level46)
(sum level38 level12 level50)
(sum level38 level19 level57)
(sum level38 level21 level59)
(sum level38 level24 level62)
(sum level39 level4 level43)
(sum level39 level8 level47)
(sum level39 level12 level51)
(sum level39 level19 level58)
(sum level39 level21 level60)
(sum level39 level24 level63)
(sum level40 level4 level44)
(sum level40 level8 level48)
(sum level40 level12 level52)
(sum level40 level19 level59)
(sum level40 level21 level61)
(sum level40 level24 level64)
(sum level41 level4 level45)
(sum level41 level8 level49)
(sum level41 level12 level53)
(sum level41 level19 level60)
(sum level41 level21 level62)
(sum level41 level24 level65)
(sum level42 level4 level46)
(sum level42 level8 level50)
(sum level42 level12 level54)
(sum level42 level19 level61)
(sum level42 level21 level63)
(sum level42 level24 level66)
(sum level43 level4 level47)
(sum level43 level8 level51)
(sum level43 level12 level55)
(sum level43 level19 level62)
(sum level43 level21 level64)
(sum level43 level24 level67)
(sum level44 level4 level48)
(sum level44 level8 level52)
(sum level44 level12 level56)
(sum level44 level19 level63)
(sum level44 level21 level65)
(sum level44 level24 level68)
(sum level45 level4 level49)
(sum level45 level8 level53)
(sum level45 level12 level57)
(sum level45 level19 level64)
(sum level45 level21 level66)
(sum level45 level24 level69)
(sum level46 level4 level50)
(sum level46 level8 level54)
(sum level46 level12 level58)
(sum level46 level19 level65)
(sum level46 level21 level67)
(sum level46 level24 level70)
(sum level47 level4 level51)
(sum level47 level8 level55)
(sum level47 level12 level59)
(sum level47 level19 level66)
(sum level47 level21 level68)
(sum level47 level24 level71)
(sum level48 level4 level52)
(sum level48 level8 level56)
(sum level48 level12 level60)
(sum level48 level19 level67)
(sum level48 level21 level69)
(sum level48 level24 level72)
(sum level49 level4 level53)
(sum level49 level8 level57)
(sum level49 level12 level61)
(sum level49 level19 level68)
(sum level49 level21 level70)
(sum level49 level24 level73)
(sum level50 level4 level54)
(sum level50 level8 level58)
(sum level50 level12 level62)
(sum level50 level19 level69)
(sum level50 level21 level71)
(sum level50 level24 level74)
(sum level51 level4 level55)
(sum level51 level8 level59)
(sum level51 level12 level63)
(sum level51 level19 level70)
(sum level51 level21 level72)
(sum level51 level24 level75)
(sum level52 level4 level56)
(sum level52 level8 level60)
(sum level52 level12 level64)
(sum level52 level19 level71)
(sum level52 level21 level73)
(sum level52 level24 level76)
(sum level53 level4 level57)
(sum level53 level8 level61)
(sum level53 level12 level65)
(sum level53 level19 level72)
(sum level53 level21 level74)
(sum level53 level24 level77)
(sum level54 level4 level58)
(sum level54 level8 level62)
(sum level54 level12 level66)
(sum level54 level19 level73)
(sum level54 level21 level75)
(sum level54 level24 level78)
(sum level55 level4 level59)
(sum level55 level8 level63)
(sum level55 level12 level67)
(sum level55 level19 level74)
(sum level55 level21 level76)
(sum level55 level24 level79)
(sum level56 level4 level60)
(sum level56 level8 level64)
(sum level56 level12 level68)
(sum level56 level19 level75)
(sum level56 level21 level77)
(sum level56 level24 level80)
(sum level57 level4 level61)
(sum level57 level8 level65)
(sum level57 level12 level69)
(sum level57 level19 level76)
(sum level57 level21 level78)
(sum level57 level24 level81)
(sum level58 level4 level62)
(sum level58 level8 level66)
(sum level58 level12 level70)
(sum level58 level19 level77)
(sum level58 level21 level79)
(sum level58 level24 level82)
(sum level59 level4 level63)
(sum level59 level8 level67)
(sum level59 level12 level71)
(sum level59 level19 level78)
(sum level59 level21 level80)
(sum level59 level24 level83)
(sum level60 level4 level64)
(sum level60 level8 level68)
(sum level60 level12 level72)
(sum level60 level19 level79)
(sum level60 level21 level81)
(sum level60 level24 level84)
(sum level61 level4 level65)
(sum level61 level8 level69)
(sum level61 level12 level73)
(sum level61 level19 level80)
(sum level61 level21 level82)
(sum level61 level24 level85)
(sum level62 level4 level66)
(sum level62 level8 level70)
(sum level62 level12 level74)
(sum level62 level19 level81)
(sum level62 level21 level83)
(sum level62 level24 level86)
(sum level63 level4 level67)
(sum level63 level8 level71)
(sum level63 level12 level75)
(sum level63 level19 level82)
(sum level63 level21 level84)
(sum level63 level24 level87)
(sum level64 level4 level68)
(sum level64 level8 level72)
(sum level64 level12 level76)
(sum level64 level19 level83)
(sum level64 level21 level85)
(sum level64 level24 level88)
(sum level65 level4 level69)
(sum level65 level8 level73)
(sum level65 level12 level77)
(sum level65 level19 level84)
(sum level65 level21 level86)
(sum level65 level24 level89)
(sum level66 level4 level70)
(sum level66 level8 level74)
(sum level66 level12 level78)
(sum level66 level19 level85)
(sum level66 level21 level87)
(sum level66 level24 level90)
(sum level67 level4 level71)
(sum level67 level8 level75)
(sum level67 level12 level79)
(sum level67 level19 level86)
(sum level67 level21 level88)
(sum level67 level24 level91)
(sum level68 level4 level72)
(sum level68 level8 level76)
(sum level68 level12 level80)
(sum level68 level19 level87)
(sum level68 level21 level89)
(sum level68 level24 level92)
(sum level69 level4 level73)
(sum level69 level8 level77)
(sum level69 level12 level81)
(sum level69 level19 level88)
(sum level69 level21 level90)
(sum level69 level24 level93)
(sum level70 level4 level74)
(sum level70 level8 level78)
(sum level70 level12 level82)
(sum level70 level19 level89)
(sum level70 level21 level91)
(sum level70 level24 level94)
(sum level71 level4 level75)
(sum level71 level8 level79)
(sum level71 level12 level83)
(sum level71 level19 level90)
(sum level71 level21 level92)
(sum level71 level24 level95)
(sum level72 level4 level76)
(sum level72 level8 level80)
(sum level72 level12 level84)
(sum level72 level19 level91)
(sum level72 level21 level93)
(sum level72 level24 level96)
(sum level73 level4 level77)
(sum level73 level8 level81)
(sum level73 level12 level85)
(sum level73 level19 level92)
(sum level73 level21 level94)
(sum level74 level4 level78)
(sum level74 level8 level82)
(sum level74 level12 level86)
(sum level74 level19 level93)
(sum level74 level21 level95)
(sum level75 level4 level79)
(sum level75 level8 level83)
(sum level75 level12 level87)
(sum level75 level19 level94)
(sum level75 level21 level96)
(sum level76 level4 level80)
(sum level76 level8 level84)
(sum level76 level12 level88)
(sum level76 level19 level95)
(sum level77 level4 level81)
(sum level77 level8 level85)
(sum level77 level12 level89)
(sum level77 level19 level96)
(sum level78 level4 level82)
(sum level78 level8 level86)
(sum level78 level12 level90)
(sum level79 level4 level83)
(sum level79 level8 level87)
(sum level79 level12 level91)
(sum level80 level4 level84)
(sum level80 level8 level88)
(sum level80 level12 level92)
(sum level81 level4 level85)
(sum level81 level8 level89)
(sum level81 level12 level93)
(sum level82 level4 level86)
(sum level82 level8 level90)
(sum level82 level12 level94)
(sum level83 level4 level87)
(sum level83 level8 level91)
(sum level83 level12 level95)
(sum level84 level4 level88)
(sum level84 level8 level92)
(sum level84 level12 level96)
(sum level85 level4 level89)
(sum level85 level8 level93)
(sum level86 level4 level90)
(sum level86 level8 level94)
(sum level87 level4 level91)
(sum level87 level8 level95)
(sum level88 level4 level92)
(sum level88 level8 level96)
(sum level89 level4 level93)
(sum level90 level4 level94)
(sum level91 level4 level95)
(sum level92 level4 level96)

(connected l0 l1)
(fuelcost level24 l0 l1)
(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l1 l0)
(fuelcost level24 l1 l0)
(connected l1 l2)
(fuelcost level19 l1 l2)
(connected l1 l3)
(fuelcost level12 l1 l3)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l1)
(fuelcost level19 l2 l1)
(connected l2 l3)
(fuelcost level4 l2 l3)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l1)
(fuelcost level12 l3 l1)
(connected l3 l2)
(fuelcost level4 l3 l2)

(at t0 l0)
(fuel t0 level96)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l2)
(at p3 l1)
(at p4 l1)
(at p5 l2)
(at p6 l3)
(at p7 l3)
(at p8 l3)
(at p9 l0)
(at p10 l1)
(at p11 l0)
(at p12 l0)
(at p13 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l0)
(at p3 l3)
(at p4 l0)
(at p5 l3)
(at p6 l1)
(at p7 l0)
(at p8 l0)
(at p9 l2)
(at p10 l3)
(at p11 l3)
(at p12 l1)
(at p13 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 14
2. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 0 of 14
3. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 0 of 14
4. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 14
5. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 14
6. (drive t0 l0 l3 level88 level8 level96)
   deleted: (at t0 l0) (fuel t0 level96)
   added: (at t0 l3) (fuel t0 level88)
   goals met: 0 of 14
7. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 14
8. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 14
9. (drive t0 l3 l2 level84 level4 level88)
   deleted: (at t0 l3) (fuel t0 level88)
   added: (at t0 l2) (fuel t0 level84)
   goals met: 0 of 14
10. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 14
11. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 2 of 14
12. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 3 of 14
13. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 3 of 14
14. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 3 of 14
15. (drive t0 l2 l1 level65 level19 level84)
   deleted: (at t0 l2) (fuel t0 level84)
   added: (at t0 l1) (fuel t0 level65)
   goals met: 3 of 14
16. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 4 of 14
17. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 5 of 14
18. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 6 of 14
19. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 6 of 14
20. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 6 of 14
21. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 6 of 14
22. (drive t0 l1 l3 level53 level12 level65)
   deleted: (at t0 l1) (fuel t0 level65)
   added: (at t0 l3) (fuel t0 level53)
   goals met: 6 of 14
23. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 6 of 14
24. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 6 of 14
25. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 7 of 14
26. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 8 of 14
27. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 9 of 14
28. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 10 of 14
29. (drive t0 l3 l0 level45 level8 level53)
   deleted: (at t0 l3) (fuel t0 level53)
   added: (at t0 l0) (fuel t0 level45)
   goals met: 10 of 14
30. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 11 of 14
31. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 12 of 14
32. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 13 of 14
33. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 14 of 14
